src/cfe/InformationRegisters/OData4_Журнал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>OData4_Журнал</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сервис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пакет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/CommonModules/OData4_Журнал/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Пишет запись журнала о запросе по настройкам журнала (уровень, режим, флажки). Никогда не бросает
// исключение: сбой уходит в журнал регистрации (событие OData4.Журнал), ответ клиенту не меняется.
// Контекст — Структура «Начало, Сервис, Метод, Путь, Параметры, Статус, Длительность, Строк, ТекстОшибки» и
// необязательные Пакет (метка записей одного $batch, этап 7) и ЗаписьВПакете (Ложь — в $batch только чтения: на
// уровне «Запись» запись пакета не пишется):
// Начало — ТекущаяУниверсальнаяДатаВМиллисекундах() в начале запроса, Параметры — Соответствие
// (Запрос.ПараметрыЗапроса) или строка. Субъект — пользователь ИБ. Настройки — Структура, как
// OData4_НастройкиСервиса.Прочитать() (для тестов); не переданы — OData4_НастройкиСервиса.Действующие().
Процедура Записать(Контекст, Настройки = Неопределено) Экспорт
	Попытка
		Если Настройки = Неопределено Тогда
			Настройки = OData4_НастройкиСервиса.Действующие();
		КонецЕсли;
		Прочитаны = Истина;
		Если Настройки.Свойство("НастройкиПрочитаны", Прочитаны) И Не Прочитаны Тогда
			// Таблицы расширения в сеансе недоступны (OData4_НастройкиСервиса.ПрочитатьБезОшибок): журнал
			// не пишется, чтобы не обращаться к регистру в таком сеансе.
			Возврат;
		КонецЕсли;
		Операция = Неопределено;
		Если ЗначениеЗаполнено(Настройки.УровеньЖурнала) И Настройки.УровеньЖурнала <> "Выключен" Тогда
			Операция = ОперацияКонтекста(Контекст);
		КонецЕсли;
		МетодУровня = Контекст.Метод;
		ЗаписьВПакете = Неопределено;
		Если Контекст.Свойство("ЗаписьВПакете", ЗаписьВПакете) И ЗаписьВПакете = Ложь Тогда
			// POST $batch только с чтениями — для уровня «Запись» это не изменение данных (наблюдение Н3 приёмки 7).
			МетодУровня = "GET";
		КонецЕсли;
		Если НужноПисать(Настройки.УровеньЖурнала, МетодУровня, Контекст.Статус, Операция)
			И ПисатьОтказВхода(Контекст, Настройки) Тогда
			Запись = НоваяЗапись(Контекст, Настройки, Операция);
			Если Настройки.ДублироватьЖурналВЖурналРегистрации Тогда
				ДублироватьВЖурналРегистрации(Запись);
			КонецЕсли;
			ДобавитьЗапись(Запись, Настройки);
		Иначе
			ДобавитьЗапись(Неопределено, Настройки);
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("OData4.Журнал", УровеньЖурналаРегистрации.Предупреждение, , ,
			"Запись журнала запросов не выполнена: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
КонецПроцедуры

// Писать ли запись запроса, если это отказ входа — ответ 401 без субъекта (нет или неверные учётные данные, токен,
// ключ продолжения). Отзыв безопасности, группа A: запросы без аутентификации при уровне «Ошибки» или «Всё» могли
// засыпать журнал. Настройка ЖурналОтказовВхода: «Все» — каждый отказ; «НеПисать» — ни одного; «Прореживать» (по
// умолчанию) — первый отказ за минуту на сервис и адрес клиента (Контекст.АдресКлиента — из доверенного заголовка
// прокси, без него все отказы делят один адрес ""), см. OData4_Безопасность.ПервыйОтказВходаВОкне. Иной запрос —
// Истина.
Функция ПисатьОтказВхода(Контекст, Настройки) Экспорт
	Если Контекст.Статус <> 401 Или Не ПустаяСтрока(OData4_Безопасность.ТекущийКонтекст().Субъект) Тогда
		Возврат Истина;
	КонецЕсли;
	Режим = "";
	Настройки.Свойство("ЖурналОтказовВхода", Режим);
	Если Режим = "Все" Тогда
		Возврат Истина;
	ИначеЕсли Режим = "НеПисать" Тогда
		Возврат Ложь;
	КонецЕсли;
	Адрес = "";
	Контекст.Свойство("АдресКлиента", Адрес);
	Возврат OData4_Безопасность.ПервыйОтказВходаВОкне(Контекст.Сервис, ?(ТипЗнч(Адрес) = Тип("Строка"), Адрес, ""),
		ТекущаяУниверсальнаяДата());
КонецФункции

// Нужно ли писать запрос при уровне журнала: Выключен — нет; Запись — методы изменения данных (POST, PUT,
// PATCH, MERGE, DELETE; действия Post и Unpost — это POST) и запрос, для которого известна операция записи
// (Операция — см. ОперацияЗапроса); Ошибки — статус 400 и выше; Всё — все запросы, включая OPTIONS.
Функция НужноПисать(Уровень, Метод, Статус, Операция = Неопределено) Экспорт
	Если Уровень = "Всё" Тогда
		Возврат Истина;
	ИначеЕсли Уровень = "Ошибки" Тогда
		Возврат Статус >= 400;
	ИначеЕсли Уровень = "Запись" Тогда
		Возврат Операция <> Неопределено Или МетодыЗаписи().Найти(ВРег(Метод)) <> Неопределено;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

// Поля записи регистра OData4_Журнал из контекста запроса: путь без секретов, параметры и текст ошибки —
// только при соответствующих флажках настроек и тоже без секретов; операция и объект записи — из Операция
// (не передана — из контекста или договорной точки 6.2, см. ОперацияКонтекста). Тело запроса не пишется.
Функция НоваяЗапись(Контекст, Настройки, Операция = Неопределено) Экспорт
	Если Операция = Неопределено Тогда
		Операция = ОперацияКонтекста(Контекст);
	КонецЕсли;
	Запись = Новый Структура("Время, Идентификатор, Дата, Сервис, Субъект, Профиль, Метод, Путь, Параметры, Статус,
		|Длительность, Строк, ТекстОшибки, Операция, Объект, Пакет");
	Запись.Операция = "";
	Запись.Объект = "";
	// Этап 7: общая метка (UUID строкой) записи POST $batch и записей его операций; вне пакета — "".
	Пакет = "";
	Контекст.Свойство("Пакет", Пакет);
	Запись.Пакет = ?(ТипЗнч(Пакет) = Тип("Строка"), Лев(Пакет, 36), "");
	Если Операция <> Неопределено Тогда
		Запись.Операция = Лев(Операция.Операция, 30);
		Запись.Объект = Лев(Операция.Объект, 255);
	КонецЕсли;
	Запись.Время = Контекст.Начало;
	Запись.Идентификатор = Новый УникальныйИдентификатор;
	Запись.Дата = МестноеВремя(Дата(1, 1, 1) + Цел(Контекст.Начало / 1000), OData4_ПовтИспВызова.ЧасовойПоясБазы());
	Запись.Сервис = Контекст.Сервис;
	Доступ = СубъектИПрофиль();
	Запись.Субъект = Доступ.Субъект;
	Запись.Профиль = Доступ.Профиль;
	Запись.Метод = Контекст.Метод;
	Запись.Путь = БезСекретов(Контекст.Путь);
	Запись.Параметры = ?(Настройки.СохранятьПараметрыЗапроса, ПараметрыБезСекретов(Контекст.Параметры), "");
	Запись.Статус = Контекст.Статус;
	Запись.Длительность = Макс(Контекст.Длительность, 0);
	Запись.Строк = ?(ТипЗнч(Контекст.Строк) = Тип("Число"), Контекст.Строк, 0);
	Тело = Неопределено;
	Контекст.Свойство("Тело", Тело);
	Запись.ТекстОшибки = ?(Настройки.СохранятьТекстОшибки, БезСекретов(БезЗначенийТела(Контекст.ТекстОшибки, Тело)), "");
	Возврат Запись;
КонецФункции

// Пора ли писать буфер журнала: режим не «Буферизованный» — всегда; иначе в буфере РазмерПачкиЖурнала
// записей или больше, или с первой записи (Буфер.Начало, мс) прошло ИнтервалПачкиЖурнала секунд и больше.
Функция НуженСброс(Буфер, Настройки, Сейчас) Экспорт
	Если Настройки.РежимЗаписиЖурнала <> "Буферизованный" Тогда
		Возврат Истина;
	КонецЕсли;
	Если Буфер.Записи.Количество() >= Макс(Настройки.РазмерПачкиЖурнала, 1) Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Буфер.Записи.Количество() > 0 И Сейчас - Буфер.Начало >= Настройки.ИнтервалПачкиЖурнала * 1000;
КонецФункции

// Пишет буфер журнала текущего сеанса, если он не пуст. Никогда не бросает исключение.
// На пути запроса буфер дописывает сама Записать: каждый запрос сеанса зовёт ДобавитьЗапись — и тот, который
// пишется в журнал, и тот, который по уровню не пишется (ДобавитьЗапись(Неопределено, …)). Поэтому остаток
// буфера уходит со следующим запросом того же сеанса; процедура нужна коду вне пути запроса (тесты) и как
// явная точка сброса. Сеанс, завершившийся с непустым буфером, свои записи теряет — это свойство режима,
// о нём предупреждает форма и README.
Процедура СброситьБуфер() Экспорт
	Попытка
		Буфер = OData4_ЖурналПовтИсп.Буфер();
		Если Буфер.Записи.Количество() > 0 Тогда
			ЗаписатьБуфер(Буфер);
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("OData4.Журнал", УровеньЖурналаРегистрации.Предупреждение, , ,
			"Запись журнала запросов не выполнена: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
КонецПроцедуры

// Добавляет к ответу заголовки CORS, если источник запроса (Origin) есть в списке ИсточникиCORS (решение 5
// плана 5.3). Никогда не бросает исключение и не меняет ответ, если источник не разрешён.
Процедура ДобавитьЗаголовкиCORS(Запрос, Ответ) Экспорт
	Попытка
		Список = OData4_НастройкиСервиса.Действующие().ИсточникиCORS;
		Если ПустаяСтрока(Список) Тогда
			Возврат;
		КонецЕсли;
		Для Каждого КлючИЗначение Из ЗаголовкиCORS(ЗаголовокЗапроса(Запрос, "Origin"), Список, Ложь) Цикл
			Ответ.Заголовки.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
	Исключение
		ЗаписьЖурналаРегистрации("OData4.Журнал", УровеньЖурналаРегистрации.Ошибка, , ,
			"Заголовки CORS не добавлены: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
КонецПроцедуры

// Ответ на OPTIONS: 204 с Allow (методы сервиса ИмяСервиса из метаданных, см. МетодыСервиса); для разрешённого
// источника — заголовки предварительного запроса CORS.
Функция ОтветOPTIONS(Запрос, ИмяСервиса = "odata") Экспорт
	Ответ = Новый HTTPСервисОтвет(204);
	Ответ.Заголовки.Вставить("Allow", МетодыСервиса(ИмяСервиса));
	Список = OData4_НастройкиСервиса.Действующие().ИсточникиCORS;
	Для Каждого КлючИЗначение Из ЗаголовкиCORS(ЗаголовокЗапроса(Запрос, "Origin"), Список, Истина, ИмяСервиса) Цикл
		Ответ.Заголовки.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	Возврат Ответ;
КонецФункции

// Заголовки CORS для источника: Соответствие «имя → значение», пустое, если источник не разрешён. Список —
// строки вида https://host[:port] по одной в строке; сравнение без учёта регистра и без завершающего «/»;
// строки «*» и «null» ничего не разрешают. Предварительный — ответ на OPTIONS: ещё Allow-Methods,
// Allow-Headers и Max-Age (методы — сервиса ИмяСервиса). Значения заголовков — только ASCII (кириллица в
// заголовке ответа приходит клиенту как «?», проба П3), поэтому источник с иными символами не разрешается.
Функция ЗаголовкиCORS(Источник, Список, Предварительный, ИмяСервиса = "odata") Экспорт
	Заголовки = Новый Соответствие;
	Origin = ?(ТипЗнч(Источник) = Тип("Строка"), СокрЛП(Источник), "");
	Если Не ИсточникДопустим(Origin) Или ТипЗнч(Список) <> Тип("Строка") Тогда
		Возврат Заголовки;
	КонецЕсли;
	Искомый = НРег(БезЗавершающейКосой(Origin));
	Разрешён = Ложь;
	Для Каждого Элемент Из СтрРазделить(СтрЗаменить(Список, Символы.ВК, ""), Символы.ПС, Ложь) Цикл
		Разрешённый = НРег(БезЗавершающейКосой(СокрЛП(Элемент)));
		Если ИсточникДопустим(Разрешённый) И Разрешённый = Искомый Тогда
			Разрешён = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если Не Разрешён Тогда
		Возврат Заголовки;
	КонецЕсли;
	Заголовки.Вставить("Access-Control-Allow-Origin", Origin);
	Заголовки.Вставить("Vary", "Origin");
	Заголовки.Вставить("Access-Control-Expose-Headers", "OData-Version, OData-EntityId, Preference-Applied, Retry-After, "
		+ "Location, ETag");
	Если Предварительный Тогда
		Заголовки.Вставить("Access-Control-Allow-Methods", МетодыСервиса(ИмяСервиса));
		Заголовки.Вставить("Access-Control-Allow-Headers", "Accept, Authorization, Content-Type, OData-Version, "
			+ "OData-MaxVersion, Prefer, X-OData4-Token, If-Match, If-None-Match");
		Заголовки.Вставить("Access-Control-Max-Age", "600");
	КонецЕсли;
	Возврат Заголовки;
КонецФункции

// Проверка списка ИсточникиCORS перед сохранением: Массив текстов ошибок (пустой — список пригоден).
// Каждая непустая строка — источник scheme://host[:port] (допускается завершающий «/»); «*», «null»,
// источник с путём, строкой запроса или без схемы, не-ASCII символы — ошибка.
Функция ОшибкиИсточниковCORS(Список) Экспорт
	Ошибки = Новый Массив;
	Если ТипЗнч(Список) <> Тип("Строка") Тогда
		Возврат Ошибки;
	КонецЕсли;
	Номер = 0;
	Для Каждого Элемент Из СтрРазделить(СтрЗаменить(Список, Символы.ВК, ""), Символы.ПС, Истина) Цикл
		Номер = Номер + 1;
		Источник = СокрЛП(Элемент);
		Если ПустаяСтрока(Источник) Тогда
			Продолжить;
		КонецЕсли;
		Причина = ПричинаНедопустимогоИсточника(Источник);
		Если Не ПустаяСтрока(Причина) Тогда
			Ошибки.Добавить("Источник CORS в строке " + Формат(Номер, "ЧГ=0") + " «" + Источник + "»: " + Причина);
		КонецЕсли;
	КонецЦикла;
	Возврат Ошибки;
КонецФункции

// Параметры запроса строкой «ключ=значение&…» в порядке ключей, без параметров token и cont (в любом
// регистре) и без подстрок, похожих на токен. Строка параметров только очищается от секретов.
Функция ПараметрыБезСекретов(Параметры) Экспорт
	Если ТипЗнч(Параметры) = Тип("Строка") Тогда
		Возврат БезСекретов(Параметры);
	ИначеЕсли Параметры = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	Ключи = Новый Массив;
	Для Каждого КлючИЗначение Из Параметры Цикл
		Если Не ЭтоСекретныйПараметр(КлючИЗначение.Ключ) Тогда
			Ключи.Добавить(КлючИЗначение.Ключ);
		КонецЕсли;
	КонецЦикла;
	Пары = Новый Массив;
	Для Каждого Ключ Из OData4_Модель.УпорядочитьСтроки(Ключи) Цикл
		Пары.Добавить(Ключ + "=" + Параметры[Ключ]);
	КонецЦикла;
	Возврат БезСекретов(СтрСоединить(Пары, "&"));
КонецФункции

// Текст для журнала без секретов: пары token=… и cont=… убирает общая функция 5.2
// (OData4_Безопасность.УбратьСекреты), подстроки вида o4_ и не меньше 20 символов base32 ([a-z2-7] без учёта
// регистра) маскирует СкрытьТокены — общая функция их не маскирует, а в журнал попадает и текст ошибки
// (решение 27 плана 5.3).
Функция БезСекретов(Текст) Экспорт
	Если ТипЗнч(Текст) <> Тип("Строка") Или ПустаяСтрока(Текст) Тогда
		Возврат "";
	КонецЕсли;
	Возврат СкрытьТокены(OData4_Безопасность.УбратьСекреты(Текст));
КонецФункции

// Текст ошибки без значений тела запроса (дефект Д1 приёмки 6.3; README: тело в журнал не пишется ни при каком
// флажке): строковые значения JSON любой вложенности (не имена свойств) от 3 знаков и числа — целые лексемы от 3
// знаков — заменяются на ***. Тело разбирается как текст, поэтому маскировка работает и для испорченного JSON. Тело
// нигде не сохраняется. Сбой маскировки — «***» вместо текста (значение тела не должно просочиться).
Функция БезЗначенийТела(Текст, Тело) Экспорт
	Если ТипЗнч(Текст) <> Тип("Строка") Или ПустаяСтрока(Текст) Или ТипЗнч(Тело) <> Тип("Строка")
		Или ПустаяСтрока(Тело) Тогда
		Возврат Текст;
	КонецЕсли;
	Попытка
		Строки = Новый Массив;
		Числа = Новый Массив;
		ЗначенияТела(Тело, Строки, Числа);
		// Тело бывает большим (пакет $batch, десятки тысяч значений), а текст ошибки короткий: заменяются только значения,
		// которые в тексте есть, — без квадратичного перебора (дефект Д4 приёмки 7).
		Результат = Текст;
		Для Каждого Значение0 Из ПоУбываниюДлины(Строки, Текст) Цикл
			Результат = СтрЗаменить(Результат, Значение0, "***");
		КонецЦикла;
		Для Каждого Лексема Из ПоУбываниюДлины(Числа, Текст) Цикл
			Результат = ЗаменитьЛексему(Результат, Лексема);
		КонецЦикла;
		Возврат Результат;
	Исключение
		Возврат "***";
	КонецПопытки;
КонецФункции

// Операция текущего запроса записи — договорная точка 6.2 OData4_Запись.ТекущаяОперация(): Структура
// «Операция, Объект» (строки) или Неопределено, если запрос не пишет. Никогда не бросает исключение.
Функция ОперацияЗапроса() Экспорт
	Попытка
		Результат = OData4_Запись.ТекущаяОперация();
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	Возврат ОперацияИз(Результат);
КонецФункции

// Субъект и профиль запроса для журнала: имя субъекта входа и представление его профиля
// (OData4_Безопасность.ТекущийКонтекст). До входа (OPTIONS, сбой входа) — пользователь ИБ сеанса и пустой
// профиль.
Функция СубъектИПрофиль()
	Результат = Новый Структура("Субъект, Профиль", ИмяПользователя(), "");
	Попытка
		Контекст = OData4_Безопасность.ТекущийКонтекст();
	Исключение
		Возврат Результат;
	КонецПопытки;
	Если Не ПустаяСтрока(Контекст.ИмяСубъекта) Тогда
		Результат.Субъект = Контекст.ИмяСубъекта;
	КонецЕсли;
	Если ЗначениеЗаполнено(Контекст.Профиль) Тогда
		Результат.Профиль = Лев(Строка(Контекст.Профиль), 150);
	КонецЕсли;
	Возврат Результат;
КонецФункции

// Методы HTTP-сервиса строкой «GET, …, OPTIONS» — по методам его шаблонов URL в метаданных (odata — сервис
// OData4, odatat — OData4T), поэтому Allow и Access-Control-Allow-Methods перечисляют ровно объявленные методы
// (решение 4 плана 6.3). Порядок: GET, HEAD, POST, PUT, PATCH, MERGE, DELETE, OPTIONS, прочие — после них по
// алфавиту; метод «любой» (ANY) даёт все методы этого порядка. Неизвестный сервис или сбой чтения метаданных —
// «GET, OPTIONS». Никогда не бросает исключение.
Функция МетодыСервиса(ИмяСервиса = "odata") Экспорт
	Порядок = СтрРазделить("GET,HEAD,POST,PUT,PATCH,MERGE,DELETE,OPTIONS", ",");
	Объявленные = Новый Массив;
	Попытка
		Имя = ?(ИмяСервиса = "odatat", "OData4T", ?(ИмяСервиса = "odata", "OData4", ""));
		Сервис = ?(Имя = "", Неопределено, Метаданные.HTTPСервисы.Найти(Имя));
		Если Сервис <> Неопределено Тогда
			Для Каждого Шаблон Из Сервис.ШаблоныURL Цикл
				Для Каждого Метод Из Шаблон.Методы Цикл
					ИмяМетода = ВРег(СокрЛП(Строка(Метод.HTTPМетод)));
					Если ИмяМетода = "ANY" Или ИмяМетода = "ЛЮБОЙ" Тогда
						Для Каждого Известный Из Порядок Цикл
							Объявленные.Добавить(Известный);
						КонецЦикла;
					ИначеЕсли Не ПустаяСтрока(ИмяМетода) Тогда
						Объявленные.Добавить(ИмяМетода);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
	Исключение
		Объявленные.Очистить();
	КонецПопытки;
	Если Объявленные.Количество() = 0 Тогда
		Возврат "GET, OPTIONS";
	КонецЕсли;
	Результат = Новый Массив;
	Для Каждого Известный Из Порядок Цикл
		Если Объявленные.Найти(Известный) <> Неопределено Тогда
			Результат.Добавить(Известный);
		КонецЕсли;
	КонецЦикла;
	Прочие = Новый Массив;
	Для Каждого ИмяМетода Из Объявленные Цикл
		Если Порядок.Найти(ИмяМетода) = Неопределено И Прочие.Найти(ИмяМетода) = Неопределено Тогда
			Прочие.Добавить(ИмяМетода);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ИмяМетода Из OData4_Модель.УпорядочитьСтроки(Прочие) Цикл
		Результат.Добавить(ИмяМетода);
	КонецЦикла;
	Возврат СтрСоединить(Результат, ", ");
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Значение заголовка запроса по имени без учёта регистра; нет заголовка — пустая строка.
Функция ЗаголовокЗапроса(Запрос, Имя)
	Искомое = НРег(Имя);
	Для Каждого КлючИЗначение Из Запрос.Заголовки Цикл
		Если НРег(КлючИЗначение.Ключ) = Искомое Тогда
			Возврат КлючИЗначение.Значение;
		КонецЕсли;
	КонецЦикла;
	Возврат "";
КонецФункции

// Источник пригоден для сравнения: непустой, не «*» и не «null», только печатные символы ASCII без пробелов.
Функция ИсточникДопустим(Значение)
	Если ПустаяСтрока(Значение) Или Значение = "*" Или НРег(Значение) = "null" Тогда
		Возврат Ложь;
	КонецЕсли;
	Для Номер = 1 По СтрДлина(Значение) Цикл
		Код = КодСимвола(Значение, Номер);
		Если Код < 33 Или Код > 126 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;
КонецФункции

Функция БезЗавершающейКосой(Значение)
	Результат = Значение;
	Пока СтрЗаканчиваетсяНа(Результат, "/") Цикл
		Результат = Лев(Результат, СтрДлина(Результат) - 1);
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Причина, по которой строка не является источником scheme://host[:port]; пустая строка — источник пригоден.
Функция ПричинаНедопустимогоИсточника(Источник)
	Если Источник = "*" Или НРег(Источник) = "null" Тогда
		Возврат "«" + Источник + "» не разрешает ни один источник, нужен адрес вида https://host[:port]";
	КонецЕсли;
	Если Не ИсточникДопустим(Источник) Тогда
		Возврат "допустимы только печатные символы ASCII без пробелов";
	КонецЕсли;
	Позиция = СтрНайти(Источник, "://");
	Если Позиция < 2 Тогда
		Возврат "нет схемы, нужен адрес вида https://host[:port]";
	КонецЕсли;
	Схема = НРег(Лев(Источник, Позиция - 1));
	Для Номер = 1 По СтрДлина(Схема) Цикл
		Если СтрНайти("abcdefghijklmnopqrstuvwxyz0123456789+-.", Сред(Схема, Номер, 1)) = 0 Тогда
			Возврат "недопустимая схема «" + Схема + "»";
		КонецЕсли;
	КонецЦикла;
	Хост = БезЗавершающейКосой(Сред(Источник, Позиция + 3));
	Если ПустаяСтрока(Хост) Тогда
		Возврат "нет имени хоста";
	КонецЕсли;
	Для Каждого Запрещённый Из СтрРазделить("/,?,#,@,\", ",") Цикл
		Если СтрНайти(Хост, Запрещённый) > 0 Тогда
			Возврат "источник не содержит путь, строку запроса и учётные данные, нужен адрес вида https://host[:port]";
		КонецЕсли;
	КонецЦикла;
	Двоеточие = СтрНайти(Хост, ":", НаправлениеПоиска.СКонца);
	Если Двоеточие > 0 И СтрНайти(Хост, "]") < Двоеточие Тогда
		Порт = Сред(Хост, Двоеточие + 1);
		Если ПустаяСтрока(Порт) Или СтрДлина(Порт) > 5 Тогда
			Возврат "недопустимый порт «" + Порт + "»";
		КонецЕсли;
		Для Номер = 1 По СтрДлина(Порт) Цикл
			Если СтрНайти("0123456789", Сред(Порт, Номер, 1)) = 0 Тогда
				Возврат "недопустимый порт «" + Порт + "»";
			КонецЕсли;
		КонецЦикла;
		Если Двоеточие = 1 Тогда
			Возврат "нет имени хоста";
		КонецЕсли;
	КонецЕсли;
	Возврат "";
КонецФункции

Функция МетодыЗаписи()
	Возврат СтрРазделить("POST,PUT,PATCH,MERGE,DELETE", ",");
КонецФункции

// Операция записи запроса: поля Операция и Объект контекста (их передают тесты) или ОперацияЗапроса().
Функция ОперацияКонтекста(Контекст)
	Если Контекст.Свойство("Операция") Тогда
		Возврат ОперацияИз(Контекст);
	КонецЕсли;
	Возврат ОперацияЗапроса();
КонецФункции

// Структура «Операция, Объект» (строки) из структуры с непустым полем Операция; иначе Неопределено.
Функция ОперацияИз(Данные)
	Если ТипЗнч(Данные) <> Тип("Структура") И ТипЗнч(Данные) <> Тип("ФиксированнаяСтруктура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Операция = Неопределено;
	Объект = Неопределено;
	Данные.Свойство("Операция", Операция);
	Данные.Свойство("Объект", Объект);
	Если ТипЗнч(Операция) <> Тип("Строка") Или ПустаяСтрока(Операция) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Новый Структура("Операция, Объект", Операция, ?(ТипЗнч(Объект) = Тип("Строка"), Объект, ""));
КонецФункции

// Строковые значения (от 3 знаков, с раскрытыми escape-последовательностями) и числовые лексемы (от 3 знаков) текста
// JSON; строка, за которой идёт «:», — имя свойства и не берётся.
Процедура ЗначенияТела(Тело, Строки, Числа)
	Длина = СтрДлина(Тело);
	Позиция = 1;
	Пока Позиция <= Длина Цикл
		Знак = Сред(Тело, Позиция, 1);
		Если Знак = """" Тогда
			Значение0 = "";
			Позиция = Позиция + 1;
			Пока Позиция <= Длина Цикл
				Знак = Сред(Тело, Позиция, 1);
				Если Знак = """" Тогда
					Прервать;
				ИначеЕсли Знак = "\" И Позиция < Длина Тогда
					Позиция = Позиция + 1;
					Код = Сред(Тело, Позиция, 1);
					Если Код = "n" Тогда
						Значение0 = Значение0 + Символы.ПС;
					ИначеЕсли Код = "t" Тогда
						Значение0 = Значение0 + Символы.Таб;
					ИначеЕсли Код = "r" Тогда
						Значение0 = Значение0 + Символы.ВК;
					ИначеЕсли Код = "u" И Позиция + 4 <= Длина Тогда
						Значение0 = Значение0 + Символ(ЧислоИзШестнадцатеричной(Сред(Тело, Позиция + 1, 4)));
						Позиция = Позиция + 4;
					ИначеЕсли Код = "b" Или Код = "f" Тогда
						// управляющие символы в тексте ошибки не встречаются
					Иначе
						Значение0 = Значение0 + Код;
					КонецЕсли;
				Иначе
					Значение0 = Значение0 + Знак;
				КонецЕсли;
				Позиция = Позиция + 1;
			КонецЦикла;
			Позиция = Позиция + 1;
			Следующая = Позиция;
			Пробелы = " " + Символы.Таб + Символы.ПС + Символы.ВК;
			Пока Следующая <= Длина И СтрНайти(Пробелы, Сред(Тело, Следующая, 1)) > 0 Цикл
				Следующая = Следующая + 1;
			КонецЦикла;
			Если СтрДлина(Значение0) >= 3 И Сред(Тело, Следующая, 1) <> ":" Тогда
				Строки.Добавить(Значение0);
			КонецЕсли;
		ИначеЕсли СтрНайти("-0123456789", Знак) > 0 Тогда
			Лексема = "";
			Пока Позиция <= Длина И СтрНайти("-+.eE0123456789", Сред(Тело, Позиция, 1)) > 0 Цикл
				Лексема = Лексема + Сред(Тело, Позиция, 1);
				Позиция = Позиция + 1;
			КонецЦикла;
			Если СтрДлина(Лексема) >= 3 Тогда
				Числа.Добавить(Лексема);
			КонецЕсли;
		Иначе
			Позиция = Позиция + 1;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ЧислоИзШестнадцатеричной(Цифры)
	Результат = 0;
	Для Номер = 1 По СтрДлина(Цифры) Цикл
		Цифра = СтрНайти("0123456789abcdef", НРег(Сред(Цифры, Номер, 1))) - 1;
		Если Цифра < 0 Тогда
			ВызватьИсключение "не шестнадцатеричная цифра";
		КонецЕсли;
		Результат = Результат * 16 + Цифра;
	КонецЦикла;
	Возврат Результат;
КонецФункции

// Строки массива, которые входят в Текст, по убыванию длины без повторов: длинное значение маскируется раньше своей
// подстроки. Повторы отсеивает Соответствие, порядок даёт сортировка таблицы — O(n log n) по числу значений.
Функция ПоУбываниюДлины(Значения, Текст)
	Встреченные = Новый Соответствие;
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Значение");
	Таблица.Колонки.Добавить("Длина");
	Для Каждого Значение0 Из Значения Цикл
		Если Встреченные.Получить(Значение0) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Встреченные.Вставить(Значение0, Истина);
		Если СтрНайти(Текст, Значение0) = 0 Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТаблицы = Таблица.Добавить();
		СтрокаТаблицы.Значение = Значение0;
		СтрокаТаблицы.Длина = СтрДлина(Значение0);
	КонецЦикла;
	Таблица.Сортировать("Длина Убыв");
	Возврат Таблица.ВыгрузитьКолонку("Значение");
КонецФункции

// Заменяет на *** вхождения числовой лексемы, которые не являются частью большего числа.
Функция ЗаменитьЛексему(Текст, Лексема)
	Результат = "";
	Остаток = Текст;
	Позиция = СтрНайти(Остаток, Лексема);
	Пока Позиция > 0 Цикл
		Слева = ?(Позиция > 1, Сред(Остаток, Позиция - 1, 1), Прав(Результат, 1));
		Справа = Сред(Остаток, Позиция + СтрДлина(Лексема), 1);
		Отдельная = (Слева = "" Или СтрНайти("0123456789.,", Слева) = 0)
			И (Справа = "" Или СтрНайти("0123456789.,", Справа) = 0);
		Результат = Результат + Лев(Остаток, Позиция - 1) + ?(Отдельная, "***", Лексема);
		Остаток = Сред(Остаток, Позиция + СтрДлина(Лексема));
		Позиция = СтрНайти(Остаток, Лексема);
	КонецЦикла;
	Возврат Результат + Остаток;
КонецФункции

Функция ЭтоСекретныйПараметр(Ключ)
	Имя = НРег(СокрЛП(Ключ));
	Возврат Имя = "token" Или Имя = "cont";
КонецФункции

// Подстроки o4_ + 20 и больше символов base32 → o4_*** (регулярных выражений в 8.3.11 нет).
Функция СкрытьТокены(Текст)
	Нижний = НРег(Текст);
	Длина = СтрДлина(Текст);
	Результат = "";
	Начало = 1;
	Позиция = СтрНайти(Нижний, "o4_", , Начало);
	Пока Позиция > 0 Цикл
		Конец = Позиция + 3;
		Пока Конец <= Длина И СтрНайти("abcdefghijklmnopqrstuvwxyz234567", Сред(Нижний, Конец, 1)) > 0 Цикл
			Конец = Конец + 1;
		КонецЦикла;
		Если Конец - Позиция - 3 >= 20 Тогда
			Результат = Результат + Сред(Текст, Начало, Позиция - Начало) + "o4_***";
			Начало = Конец;
		КонецЕсли;
		Если Конец > Длина Тогда
			Прервать;
		КонецЕсли;
		Позиция = СтрНайти(Нижний, "o4_", , Макс(Конец, Позиция + 3));
	КонецЦикла;
	Возврат Результат + Сред(Текст, Начало);
КонецФункции

// Добавляет запись в журнал: в основном режиме — сразу; в буферизованном — в буфер сеанса, который пишется
// пачкой, когда в нём РазмерПачкиЖурнала записей или первой записи больше ИнтервалПачкиЖурнала секунд
// (решение 1 плана 5.3). Запись = Неопределено — только проверка, не пора ли записать буфер. Буфер
// очищается до записи пачки: при сбое пачка не копится, а сбой с числом потерянных записей уходит в журнал
// регистрации из Записать.
Процедура ДобавитьЗапись(Запись, Настройки)
	Буфер = OData4_ЖурналПовтИсп.Буфер();
	Если Запись <> Неопределено Тогда
		Если Буфер.Записи.Количество() = 0 Тогда
			Буфер.Начало = Запись.Время;
		КонецЕсли;
		Буфер.Записи.Добавить(Запись);
	КонецЕсли;
	Если Буфер.Записи.Количество() = 0 Или Не НуженСброс(Буфер, Настройки, ТекущаяУниверсальнаяДатаВМиллисекундах()) Тогда
		Возврат;
	КонецЕсли;
	ЗаписатьБуфер(Буфер);
КонецПроцедуры

// Пишет содержимое буфера одной пачкой и очищает буфер (до записи).
Процедура ЗаписатьБуфер(Буфер)
	Записи = Буфер.Записи;
	Буфер.Записи = Новый Массив;
	Буфер.Начало = 0;
	Попытка
		ЗаписатьПачку(Записи);
	Исключение
		ВызватьИсключение "Пачка журнала не записана, потеряно записей: " + Формат(Записи.Количество(), "ЧГ=0") + ": "
			+ КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
КонецПроцедуры

// Пишет записи в одной транзакции, каждую — набором с отбором по её ключу (Время, Идентификатор): управляемая
// блокировка ставится только на ключи новых записей, и запись не ждёт других писателей журнала (в
// клиент-серверной базе). Блокировку всего регистра (например, чужой транзакцией) платформа ждёт до своего
// тайм-аута: способа записать без ожидания или узнать о блокировке заранее у расширения нет —
// УстановитьВремяОжиданияБлокировкиДанных меняет параметр всей информационной базы (решение 22 плана 5.3).
Процедура ЗаписатьПачку(Записи)
	НачатьТранзакцию();
	Попытка
		Для Каждого Запись Из Записи Цикл
			Набор = РегистрыСведений.OData4_Журнал.СоздатьНаборЗаписей();
			Набор.Отбор.Время.Установить(Запись.Время);
			Набор.Отбор.Идентификатор.Установить(Запись.Идентификатор);
			ЗаполнитьЗначенияСвойств(Набор.Добавить(), Запись);
			Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
			Набор.Записать();
		КонецЦикла;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

// Событие OData4.Запрос: Информация для статуса ниже 500, Ошибка — 500 и выше.
Процедура ДублироватьВЖурналРегистрации(Запись)
	Уровень = ?(Запись.Статус >= 500, УровеньЖурналаРегистрации.Ошибка, УровеньЖурналаРегистрации.Информация);
	Комментарий = Запись.Метод + " " + Запись.Путь
		+ ?(ПустаяСтрока(Запись.Операция), "", " [" + Запись.Операция + " " + Запись.Объект + "]")
		+ ?(ПустаяСтрока(Запись.Параметры), "", "?" + Запись.Параметры)
		+ " → " + Формат(Запись.Статус, "ЧН=0; ЧГ=0")
		+ " (" + Формат(Запись.Длительность, "ЧН=0; ЧГ=0") + " мс, " + Формат(Запись.Строк, "ЧН=0; ЧГ=0") + " строк) "
		+ Запись.Субъект
		+ ?(ПустаяСтрока(Запись.Пакет), "", " [пакет " + Запись.Пакет + "]")
		+ ?(ПустаяСтрока(Запись.ТекстОшибки), "", ": " + Запись.ТекстОшибки);
	ЗаписьЖурналаРегистрации("OData4.Запрос", Уровень, , , Комментарий);
КонецПроцедуры

#КонецОбласти
